# Разбор возможных задач на экзамен

## Содержание

+ [Динамические массивы](#динамические-массивы)


## Динамические массивы

### 5.5 Реверс последовательности

Написать программу, осуществляющую вывод на стандартный поток stdout через пробел в обратном порядке элементов последовательности, состоящей из целых неотрицательных чисел.
Последовательность задается на стандартный поток ввода stdin, элементы последовательности разделены между собой пробелами, концом последовательности является число -1, которое обозначает конец последовательности и не является ее элементом.
В конце ответа не должно быть переноса на новую строку.
Проверить на валидность введенные данные.
В случае любой ошибки выводить "n/a".

```c
#include <stdio.h>
#include <stdlib.h>

int main() {
    int *array, index = 0;
    array = (int *)malloc(index + 1 * sizeof(int));

    if (array != NULL) {
        while (1) {
            scanf("%d", &array[index]);
            if (array[index] == -1) {
                break;
            }
            index++;
            array = (int *)realloc(array, index + 1 * sizeof(int));
        }

        for (int i = index - 1; i >= 0; i--) {
            printf("%d%s", array[i], i == 0 ? "" : " ");
        }
        free(array);
    } else {
        printf("n/a");
    }

    return 0;
}
```


[Содержание](#содержание)
